Revit 2027 API
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>, Boolean) Constructor
 Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementPhaseStatusFilter(
	ElementId phaseId,
	ICollection<ElementOnPhaseStatus> phaseStatuses,
	bool inverted
)
Public Sub New (
	phaseId As ElementId,
	phaseStatuses As ICollection(Of ElementOnPhaseStatus),
	inverted As Boolean
)
public:
ElementPhaseStatusFilter(
	ElementId^ phaseId,
	ICollection<ElementOnPhaseStatus>^ phaseStatuses,
	bool inverted
)
new :
        phaseId : ElementId *
        phaseStatuses : ICollection<ElementOnPhaseStatus> *
        inverted : bool -> ElementPhaseStatusFilter
Parameters
phaseId ElementId
 Id of the phase.
phaseStatuses ICollection<ElementOnPhaseStatus>
 Target statuses.
inverted Boolean
 True to match all phase statuses other than the input statuses.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementPhaseStatusFilter Class
ElementPhaseStatusFilter Overload
Autodesk.Revit.DB Namespace